import co.elastic.clients.elasticsearch.indices.ElasticsearchIndicesClient;
import elastic.tms.util.TmsUtils;

public class IndexTest {
    public static void main (String [] args ) {
        System.out.println( TmsUtils.getTmsRawStream("채무자, 담보제공자 등의 자진변제에 의한 채권을 회수하는 경우에 해당 사업본부는 사전에 경영관리본부와 합의를 거쳐야 한다. 대손의 확정 및 처리 부실채권에 대한 회수절차 및 조치사항이 사실상 종결되어 채권회수 가능성이 없다고 판단되는 경우에는 해당 사업본부장은 경영관리본부 재무팀의 검토 결과에 따라 대손액을 확정한다. 전항에 의거 대손이 확정된 부실채권에 대해서 해당 사업본부장은 즉시 경영관리본부 재무팀과 협의하여 법적으로 대손처리요건에 충족되는 제증빙서류를 구비하여 대손처리를 의뢰한다. 사후관리 경영관리본부 및 해당 사업본부는 전후의 대손확정업체에 대해서 실제 대손처리 여부에 관계없이 지속적인 사후관리(채무자, 보증인의 정기적인 재산추적 등)를 하여야 한다. 징 계 부실채권 발생 해당 사업본부 팀장, 그룹장 및 사업본부장은 제 7조에 의거 발생보고를 성실히 이행하여야 하며 이를 은닉, 허위보고 및 해태할 경우 대표이사는 징계위원회에 자문하여 해당사원을 징계할 수 있다. 부 칙 1. 시행일 이 규정은 2019년 07월 01일부터 시행한다. ㈜솔트룩스 규정 - 28[Rev."));
        System.out.println( TmsUtils.getTmsNeStr("채무자, 담보제공자 등의 자진변제에 의한 채권을 회수하는 경우에 해당 사업본부는 사전에 경영관리본부와 합의를 거쳐야 한다. 대손의 확정 및 처리 부실채권에 대한 회수절차 및 조치사항이 사실상 종결되어 채권회수 가능성이 없다고 판단되는 경우에는 해당 사업본부장은 경영관리본부 재무팀의 검토 결과에 따라 대손액을 확정한다. 전항에 의거 대손이 확정된 부실채권에 대해서 해당 사업본부장은 즉시 경영관리본부 재무팀과 협의하여 법적으로 대손처리요건에 충족되는 제증빙서류를 구비하여 대손처리를 의뢰한다. 사후관리 경영관리본부 및 해당 사업본부는 전후의 대손확정업체에 대해서 실제 대손처리 여부에 관계없이 지속적인 사후관리(채무자, 보증인의 정기적인 재산추적 등)를 하여야 한다. 징 계 부실채권 발생 해당 사업본부 팀장, 그룹장 및 사업본부장은 제 7조에 의거 발생보고를 성실히 이행하여야 하며 이를 은닉, 허위보고 및 해태할 경우 대표이사는 징계위원회에 자문하여 해당사원을 징계할 수 있다. 부 칙 1. 시행일 이 규정은 2019년 07월 01일부터 시행한다. ㈜솔트룩스 규정 - 28[Rev."));

        System.exit(0);
    }
}
